html/scheme/tutorial/branch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>分支</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="function.html"> UP </a>
 |
 <a accesskey="H" href="slt.html"> HOME </a>
</div><div id="content">
<h1 class="title">分支</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga4ad40f">if 表达式</a></li>
<li><a href="#org10c8bcb">复合逻辑</a>
<ul>
<li><a href="#orgd070188">not</a></li>
<li><a href="#org8f74afa">and</a></li>
<li><a href="#org966e227">or</a></li>
</ul>
</li>
<li><a href="#org1e62e3f">cond 表达式</a></li>
<li><a href="#orgf43c496">谓词函数</a>
<ul>
<li><a href="#org9046088">eq?、eqv?和equal?</a></li>
<li><a href="#orga6d9fe3">检查数据类型</a></li>
<li><a href="#org9c194ae">比较数值</a></li>
<li><a href="#org1a65271">比较字符</a></li>
<li><a href="#orgfb066c7">比较字符串</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
本章中会讲解如何通过 <b>条件</b> 编写过程。这个是编写使用程序很重要的一步
</p>
<div id="outline-container-orga4ad40f" class="outline-2">
<h2 id="orga4ad40f">if 表达式</h2>
<div class="outline-text-2" id="text-orga4ad40f">
<p>
<span class="underline">if</span> 表达式将过程分为两个部分。格式如下：
</p>

<pre class="example">
(if predicate then-value else-value)
</pre>

<p>
如果 <span class="underline">predicate</span> 部分为 <b>真</b> ，那么 <span class="underline">then-value</span> 部分 <b>被求值</b> ，否则 <span class="underline">else-value</span> 部分被 <b>求值</b> ，并且  <span class="underline">求得的值</span> 会 <b>返回</b> 给 <span class="underline">if语句的括号外</span>  
</p>

<p>
<b>true</b> 是除 <b>false</b> 以外的任意值：
</p>
<ul class="org-ul">
<li><span class="underline">true</span> 使用 <b>#t</b> 表示</li>
<li><span class="underline">false</span> 用 <b>#f</b> 表示</li>
</ul>

<pre class="example">
    在R5RS中，false #f 和空表 '() 是两个不同的对象

    然而，在MIT-Scheme中，这两个为同一对象

    这个不同可能是历史遗留问题，在以前的标准R4RS中，#f 和 '() 被定义为同一对象
</pre>

<p>
从兼容性角度考虑，  <span class="underline">不应该使用表目录作为谓词</span> 。使用函数 <span class="underline">null?</span> 来判断 <b>表是否为空</b> 
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>null? '<span style="color: #696969;">())</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t </span>

<span style="color: #696969;">(</span>null? '<span style="color: #696969;">(</span>a b c<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#f </span>
</pre>
</div>

<p>
if 表达式是一个 <span class="underline">特殊形式</span> ，因为它 <b>不对所有的参数求值</b> 
</p>
<ul class="org-ul">
<li>如果 predicate 为真，则只有 then-value 部分被求值</li>
<li>如果 predicate 为假，只有 else-value 部分被求值</li>
</ul>

<p>
例，首项为 a0，增长率 r，项数为 n 的几何增长数列之和：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">sum-gp</span> a0 r n<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>* a0
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>= r 1<span style="color: #696969;">)</span>
         n
         <span style="color: #696969;">(</span>/ <span style="color: #696969;">(</span>- 1 <span style="color: #696969;">(</span>expt r n<span style="color: #696969;">))</span> <span style="color: #696969;">(</span>- 1 r<span style="color: #696969;">)))))</span>   <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">!!</span>
</pre>
</div>

<pre class="example">
通常来说，几何增长数列的求和公式如下：

a0 * (1 - r^n) / (1 - r)                      (r ≠ 1)
a0 * n                                               (r = 1)

如果 if 表达式对所有参数求值的话，那么有 ;!! 注释的那行就算在 r = 1 时也会被求值，这将导致产生一个 除数为0 的错误
</pre>

<p>
可以省去 <span class="underline">else-value</span> 项。当 <span class="underline">predicate</span> 为假时， <b>返回值就没有被指定</b> 。如果你希望当predicate为假时返回 <span class="underline">#f</span> ，那么就要明确地将它写出来
</p>

<pre class="example">
then-value 和 else-value 都应该是 S-表达式

如果你需要副作用 ，那么就应该使用 begin 表达式
</pre>
</div>
</div>
<div id="outline-container-org10c8bcb" class="outline-2">
<h2 id="org10c8bcb">复合逻辑</h2>
<div class="outline-text-2" id="text-org10c8bcb">
</div>
<div id="outline-container-orgd070188" class="outline-3">
<h3 id="orgd070188">not</h3>
<div class="outline-text-3" id="text-orgd070188">
<p>
函数 <span class="underline">not</span> 可用于对 <b>谓词取反</b> ：此函数只有 <span class="underline">一个参数</span> 
</p>
<ul class="org-ul">
<li>如果参数值为 <span class="underline">#f</span> 则返回 <span class="underline">#t</span></li>
<li>参数值为 <span class="underline">#t</span> 则返回 <span class="underline">#f</span></li>
</ul>
</div>
</div>

<div id="outline-container-org8f74afa" class="outline-3">
<h3 id="org8f74afa">and</h3>
<div class="outline-text-3" id="text-org8f74afa">
<p>
<span class="underline">and</span> 具有 <span class="underline">任意个数的参数</span> ，并从左到右对它们求值：
</p>
<ul class="org-ul">
<li>如果某一参数为 <span class="underline">#f</span> ，那么它就返回 <span class="underline">#f</span> ，而 <b>不对剩余参数求值</b></li>
<li>如果所有的参数都不是 <span class="underline">#f</span> ，那么就返回 <span class="underline">最后一个参数的值</span></li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">and</span> #f 0<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#f</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">and</span> 1 2 3<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#3 </span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">and</span> 1 2 3 #f<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#f </span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org966e227" class="outline-3">
<h3 id="org966e227">or</h3>
<div class="outline-text-3" id="text-org966e227">
<p>
<span class="underline">or</span> 具有 <span class="underline">可变个数的参数</span> ，并从左到右对它们求值：
</p>
<ul class="org-ul">
<li>它返回第一个 <span class="underline">不是值#f的参数</span> ，而 <b>余下的参数不会被求值</b></li>
<li>如果 <span class="underline">所有的参数的值都是 #f</span> 的话，则返回 <span class="underline">#f</span></li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">or</span> #f 0<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;  </span><span style="color: #5f9ea0; font-style: italic;">0 </span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">or</span> 1 2 3<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">1</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">or</span> #f 1 2 3<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">1 </span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">or</span> #f #f #f<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#f</span>
</pre>
</div>

<pre class="example">
and 和 or 是用于组合条件的两个特殊形式

Scheme中的and和or不同于C语言中的约定
   它们不返回一个布尔值（#t 或 #f）
   而是返回给定的参数之一

and和or可以使你的代码更加短小
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e62e3f" class="outline-2">
<h2 id="org1e62e3f">cond 表达式</h2>
<div class="outline-text-2" id="text-org1e62e3f">
<pre class="example">
    尽管所有的分支都可以用 if表达式 表达

    但当条件有更多的可能性时，就需要使用嵌套的if表达式了，这将使代码变得复杂
</pre>
<p>
处理这种情况可以使用 <b>cond表达式</b> 。cond表达式的格式如下：
</p>

<pre class="example">
(cond
  (predicate-1 clauses-1)
  (predicate-2 clauses-2)
    ......
  (predicate-n clauses-n)
  (else        clauses-else))
</pre>

<p>
在 <span class="underline">cond表达式</span> 中， <span class="underline">predicates-i</span> 是按照 <b>从上到下</b> 的顺序求值：
</p>
<ul class="org-ul">
<li>当 <span class="underline">predicates-i</span> 为 <b>真</b> 时， <span class="underline">clause-i</span> 会被 <b>求值并返回</b></li>
<li><span class="underline">i</span> 之后的 <span class="underline">predicates</span> 和 <span class="underline">clauses</span> <b>不会被求值</b></li>
<li>如果所有的 <span class="underline">predicates-i</span> 都是 <b>假</b> 的话，则返回 <span class="underline">cluase-else</span></li>
</ul>

<p>
在一个子句中，可以写数条S-表达式，而 <span class="underline">clause</span> 的值是 <span class="underline">最后一条 S-表达式</span> 
</p>

<pre class="example">
例：城市游泳池的收费。

Foo市的城市游泳池按照顾客的年龄收费：

如果 age ≤ 3 或者 age ≥ 65 则 免费；
如果 介于 4 ≤ age ≤ 6 则 0.5美元；
如果 介于 7 ≤ age ≤ 12 则 1.0美元；
如果 介于 13 ≤ age ≤ 15 则 1.5美元；
如果 介于 16 ≤ age ≤ 18 则 1.8美元；
其它 则 2.0美元；
</pre>

<p>
那么，一个返回城市游泳池收费的函数如下：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">fee</span> age<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span>
   <span style="color: #696969;">((</span><span style="color: #00bfff; font-weight: bold;">or</span> <span style="color: #696969;">(</span>&lt;= age 3<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>&gt;= age 65<span style="color: #696969;">))</span> 0<span style="color: #696969;">)</span>
   <span style="color: #696969;">((</span>&lt;= 4 age 6<span style="color: #696969;">)</span> 0.5<span style="color: #696969;">)</span>
   <span style="color: #696969;">((</span>&lt;= 7 age 12<span style="color: #696969;">)</span> 1.0<span style="color: #696969;">)</span>
   <span style="color: #696969;">((</span>&lt;= 13 age 15<span style="color: #696969;">)</span> 1.5<span style="color: #696969;">)</span>
   <span style="color: #696969;">((</span>&lt;= 16 age 18<span style="color: #696969;">)</span> 1.8<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span> 2.0<span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf43c496" class="outline-2">
<h2 id="orgf43c496">谓词函数</h2>
<div class="outline-text-2" id="text-orgf43c496">
<p>
这里将介绍一些用于做判断的函数。这些函数的名字都以 <span class="underline">'?'</span> 结尾
</p>
</div>

<div id="outline-container-org9046088" class="outline-3">
<h3 id="org9046088">eq?、eqv?和equal?</h3>
<div class="outline-text-3" id="text-org9046088">
<p>
基本函数 <span class="underline">eq?</span> 、 <span class="underline">eqv?</span> 、 <span class="underline">equal?</span> 具有 <b>两个参数</b> ，用于检查 <b>这两个参数是否“一致”</b> 。这三个函数之间略微有些区别：
</p>

<p>
<span class="underline">eq?</span> 用来比较两个是否是 <b>同一个对象</b> （指向的地址是否相同）
</p>

<pre class="example">
     例如，(eq? str str) 返回 #t，因为str本身的地址是一致的

     与此相对的，因为字符串 "hello" 和 "hello" 被储存在了不同的地址中，函数将返回 #f

     不要使用eq?来比较数字，因为不仅在R5RS中，甚至在MIT-Scheme实现中，它都没有指定返回值

     使用eqv?或者=来比较数值
</pre>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">str</span> <span style="color: #deb887;">"hello"</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span>eq? str str<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t </span>
<span style="color: #696969;">(</span>eq? <span style="color: #deb887;">"hello"</span> <span style="color: #deb887;">"hello"</span><span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#f</span>

<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">comparing numbers depends on implementations</span>
<span style="color: #696969;">(</span>eq? 1 1<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t </span>
<span style="color: #696969;">(</span>eq? 1.0 1.0<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#f </span>
</pre>
</div>

<p>
<span class="underline">eqv?</span> 该函数比较两个存储在内存中的 <b>对象的类型 和 值</b>  。如果类型和值都一致的话就返回 #t
</p>
<pre class="example">
eq? 一样，但相同的数字会被认为一样

对于过程（lambda表达式）的比较依赖于具体的实现

这个函数不能用于类似于 表 和 字符串 一类的序列比较，因为尽管这些序列看起来是一致的，但它们的值是存储在不同的地址中
</pre>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>eqv? 1.0 1.0<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t </span>
<span style="color: #696969;">(</span>eqv? 1 1.0<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#f </span>

<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">don't use it to compare sequences</span>
<span style="color: #696969;">(</span>eqv? <span style="color: #696969;">(</span>list 1 2 3<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>list 1 2 3<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#f </span>

<span style="color: #696969;">(</span>eqv? <span style="color: #deb887;">"hello"</span> <span style="color: #deb887;">"hello"</span><span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#f </span>

<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">the following depends on implementations</span>
<span style="color: #696969;">(</span>eqv? <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span><span style="color: #696969;">(</span>x<span style="color: #696969;">)</span> x<span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>x<span style="color: #696969;">)</span> x<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#f </span>
</pre>
</div>

<p>
<span class="underline">equal?</span>  函数用于比较类似于 <span class="underline">表</span> 或者 <span class="underline">字符串</span> 一类的序列
</p>
<pre class="example">
     不仅比较值，还会深层地比较变量的数据结构
</pre>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>equal? <span style="color: #696969;">(</span>list 1 2 3<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>list 1 2 3<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t </span>
<span style="color: #696969;">(</span>equal? <span style="color: #deb887;">"hello"</span> <span style="color: #deb887;">"hello"</span><span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t </span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga6d9fe3" class="outline-3">
<h3 id="orga6d9fe3">检查数据类型</h3>
<div class="outline-text-3" id="text-orga6d9fe3">
<p>
下面列举了几个用于 <b>检查类型</b> 的函数。这些函数都只有 <span class="underline">一个参数</span> ：
</p>
<ul class="org-ul">
<li><span class="underline">pair?</span>  如果对象为 <b>序对</b> 则返回 <span class="underline">#t</span></li>
<li><span class="underline">list?</span>  如果对象是一个 <b>表</b> 则返回 <span class="underline">#t</span></li>
<li><span class="underline">null?</span> 如果对象是 <b>空表</b> <span class="underline">'()</span> 的话就返回 <span class="underline">#t</span></li>
<li><span class="underline">symbol?</span> 如果对象是一个 <b>符号</b> 则返回 <span class="underline">#t</span></li>
<li><span class="underline">char?</span> 如果对象是一个 <b>字符</b> 则返回 <span class="underline">#t</span></li>
<li><span class="underline">string?</span> 如果对象是一个 <b>字符串</b> 则返回 <span class="underline">#t</span></li>
<li><span class="underline">number?</span> 如果对象是一个 <b>数字</b> 则返回 <span class="underline">#t</span></li>
<li><span class="underline">complex?</span> 如果对象是一个 <b>复数</b> 则返回 <span class="underline">#t</span></li>
<li><span class="underline">real?</span> 如果对象是一个 <b>实数</b> 则返回 <span class="underline">#t</span></li>
<li><span class="underline">rational?</span> 如果对象是一个 <b>有理数</b> 则返回 <span class="underline">#t</span></li>
<li><span class="underline">integer?</span> 如果对象是一个 <b>整数</b> 则返回 <span class="underline">#t</span></li>
<li><span class="underline">exact?</span> 如果对象 <b>不是</b> 一个 <b>浮点数</b> 的话则返回 <span class="underline">#t</span></li>
<li><span class="underline">inexact?</span> 如果对象是一个 <b>浮点数</b> 的话则返回 <span class="underline">#t</span></li>
</ul>

<pre class="example">
   要小心的是空表 '() 是一个表，但不是一个序对
</pre>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>pair? '<span style="color: #696969;">())</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#f </span>
<span style="color: #696969;">(</span>list? '<span style="color: #696969;">())</span>  <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t </span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9c194ae" class="outline-3">
<h3 id="org9c194ae">比较数值</h3>
<div class="outline-text-3" id="text-org9c194ae">
<p>
<b>=</b> 、 <b>&gt;</b> 、 <b>&lt;</b> 、 <b>&lt;=</b> 、 <b>&gt;=</b> 这些函数都有 <span class="underline">任意个数的参数</span> 。如果 <b>参数是按照这些函数的名字排序</b> 的话，函数就返回 <span class="underline">#t</span> 
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>= 1 1 1.0<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t</span>
<span style="color: #696969;">(</span>&lt; 1 2 3<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t </span>
<span style="color: #696969;">(</span>&lt; 1<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t</span>
<span style="color: #696969;">(</span>&lt;<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t </span>

<span style="color: #696969;">(</span>= 2 2 2<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t </span>
<span style="color: #696969;">(</span>&lt; 2 3 3.1<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t </span>
<span style="color: #696969;">(</span>&gt; 4 1 -0.2<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;</span><span style="color: #5f9ea0; font-style: italic;">#t </span>

<span style="color: #696969;">(</span>&lt;= 1 1 1.1<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;</span><span style="color: #5f9ea0; font-style: italic;">#t </span>

<span style="color: #696969;">(</span>&gt;= 2 1 1.0<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#t </span>

<span style="color: #696969;">(</span>&lt;= 3 4 3.9<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#f </span>
</pre>
</div>

<p>
<span class="underline">odd?</span> 、 <span class="underline">even?</span> 、 <span class="underline">positive?</span> 、 <span class="underline">negative?</span> 、 <span class="underline">zero?</span> 这些函数仅有 <span class="underline">一个参数</span> ，如果这些参数 <b>满足函数名所指示的条件</b> 话就返回 <span class="underline">#t</span> 
</p>
</div>
</div>
<div id="outline-container-org1a65271" class="outline-3">
<h3 id="org1a65271">比较字符</h3>
<div class="outline-text-3" id="text-org1a65271">
<p>
在 <b>比较字符</b> 的时候可以使用 <span class="underline">char=?</span> 、 <span class="underline">char&lt;?</span> 、 <span class="underline">char&gt;?</span> 、 <span class="underline">char&lt;=?</span> 以及 <span class="underline">char&gt;=?</span> 函数
</p>
</div>
</div>
<div id="outline-container-orgfb066c7" class="outline-3">
<h3 id="orgfb066c7">比较字符串</h3>
<div class="outline-text-3" id="text-orgfb066c7">
<p>
<b>比较字符串</b> 时，可以使用 <span class="underline">string=?</span> 和 <span class="underline">string-ci=?</span> 等函数
</p>

<p>
<a href="local_variable.html">Next：局部变量</a>
</p>

<p>
<a href="function.html">Previous：定义函数</a>
</p>

<p>
<a href="slt.html">Home：目录</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
